'use strict';
const { faker } = require('@faker-js/faker');

const categoriesList = [
  {
    title: "Комп'ютери",
    value: 'computers',
    desc: "Категорія Комп'ютери пропонує різноманітні комп'ютерні системи, які задовольнять потреби користувачів з різних сфер життя та роботи. Від потужних ігрових систем до надійних робочих станцій і компактних неттопів, тут представлені рішення для кожного. Геймерам можуть сподобатися високопродуктивні системи з потужними графічними картами і швидкими процесорами, які забезпечують плавний геймплей та високу якість зображення. Для бізнесу і творчості доступні робочі станції з потужними процесорами та великим обсягом оперативної та накопичувальної пам'яті, що дозволяє швидко та ефективно виконувати складні завдання. Користувачі, які цінують мобільність, можуть вибрати ноутбуки або нетбуки з різними характеристиками і функціональністю для роботи в дорозі або вдома. Крім того, тут можна знайти комп'ютери для дому і офісу з простими та надійними конфігураціями, які відповідають основним потребам користувачів.",
  },
  {
    title: 'Смартфони',
    value: 'smartphones',
    desc: 'Смартфони на сучасному ринку є однією з найбільш динамічних та інноваційних. Смартфони стали невід`ємною частиною нашого повсякденного життя, об`єднуючи в собі функції телефону, камери, мультимедійного пристрою та особистого комп`ютера. Вони постійно розвиваються і стають все потужнішими, функціональнішими та більш ергономічними. Велика конкуренція серед виробників призводить до швидкого впровадження новітніх технологій та інноваційних рішень у смартфонах, що дозволяє користувачам обирати з широкого спектру пристроїв, які відповідають їхнім потребам та бажанням.',
  },
  {
    title: 'Холодильники',
    value: 'refrigerators',
    desc: 'Холодильники пропонує широкий вибір сучасних холодильників, які відповідають найвищим стандартам якості та ефективності. Вони призначені для забезпечення зберігання продуктів їжі на оптимальній температурі, зберігаючи їх свіжість та корисні властивості на тривалий час. Сучасні холодильники оснащені різноманітними функціями, такими як системи автоматичного розморожування, регулювання вологості, швидке охолодження та зони для зберігання різних типів продуктів. Вони також можуть мати стильний дизайн і вбудовуватися в інтер`єр будь-якої кухні.',
  },
  {
    title: 'Телевізори',
    value: 'televisions',
    desc: 'Телевізори пропонує широкий вибір сучасних телевізорів з різними технологіями та функціями, що задовольнять потреби будь-якого споживача. Від екранів з великою діагоналлю та високою роздільною здатністю до тонких OLED-панелей із вражаючими кольорами та чіткістю зображення, телевізори цієї категорії забезпечують неперевершений досвід перегляду. Деякі моделі оснащені сучасними функціями, такими як смарт-технології, вбудовані аудіосистеми високої якості та можливість підключення до інтернету для стрімінгу відео з різних сервісів. Також, ви можете знайти телевізори з різними дизайнами та розмірами, які підійдуть для будь-якого приміщення.',
  },
  {
    title: 'Монітори',
    value: 'monitors',
    desc: 'Монітори пропонує широкий вибір сучасних дисплеїв для різних потреб користувачів. Від великих іммерсивних геймінгових моніторів з високою частотою оновлення до професійних моніторів з високою роздільною здатністю для роботи з графікою, тут представлені моделі для будь-яких завдань. Деякі монітори мають вражаючу кольорову гаму та широкий кут огляду, що ідеально підходить для фото- та відеоредагування. Ігрові монітори відрізняються великим розміром екрану, високою частотою оновлення та низькою затримкою відгуку, забезпечуючи інтенсивний ігровий досвід без розривів чи розмиття зображення. Крім того, в асортименті є монітори з різними характеристиками, такими як роздільна здатність, панельна технологія та підтримка HDR, щоб кожен знайшов відповідний для себе варіант.',
  },
  {
    title: 'Ноутбуки',
    value: 'laptops',
    desc: 'Категорія "Ноутбуки" охоплює широкий спектр персональних комп\'ютерів, які стали невід\'ємною частиною сучасного життя. Від надзвичайно мобільних та компактних моделей для роботи в дорозі до потужних ігрових пристроїв і професійних робочих станцій, ноутбуки дозволяють користувачам залишатися підключеними та продуктивними в будь-якому місці і в будь-який час. Товари в цій категорії представлені різними моделями від різних виробників, які відрізняються за характеристиками, дизайном та функціональністю, щоб задовольнити потреби широкого кола користувачів.',
  },
  // { title: 'Фото-техніка', value: 'photo_equip' },
  // { title: 'Мікрохвильові печі', value: 'microwaves' },
  // { title: 'Планшети', value: 'tablets' },
];

/** @type {import("sequelize-cli").Migration} */
module.exports = {
  async up(queryInterface, Sequelize) {
    console.log('2');
    return queryInterface.bulkInsert(
      'Categories',
      categoriesList.map((category) => ({
        category_name: category.title,
        category_value: category.value,
        description: category.desc || faker.lorem.sentence(16),
        filters: JSON.stringify([]),
        createdAt: new Date(),
        updatedAt: new Date(),
      })),
      {
        // ignoreDuplicates: true,
        updateOnDuplicate: ['filters', 'description'],
      },
    );
    /**
     * Add seed commands here.
     *
     * Example:
     * await queryInterface.bulkInsert('People', [{
     *   name: 'John Doe',
     *   isBetaMember: false
     * }], {});
     */
  },

  async down(queryInterface, Sequelize) {
    return queryInterface.bulkDelete('Categories', null, {});
    /**
     * Add commands to revert seed here.
     *
     * Example:
     * await queryInterface.bulkDelete('People', null, {});
     */
  },
};
